mysqldump: [Warning] Using a password on the command line interface can be insecure.
-- MySQL dump 10.13  Distrib 5.7.44, for Linux (x86_64)
--
-- Host: localhost    Database: lius
-- ------------------------------------------------------
-- Server version	5.7.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `lius`
--

DROP TABLE IF EXISTS `lius`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `lius` (
  `liusID` int(11) NOT NULL AUTO_INCREMENT,
  `namez` varchar(30) NOT NULL COMMENT '姓名',
  `generation` int(11) NOT NULL DEFAULT '0' COMMENT '第n代',
  `roomOrder` int(11) NOT NULL DEFAULT '0' COMMENT '第幾房',
  `siblingOrder` int(11) NOT NULL DEFAULT '1' COMMENT '第幾房',
  `parentID` int(11) NOT NULL DEFAULT '0' COMMENT '父親ID',
  `meno` text NOT NULL COMMENT '備註',
  `source` varchar(50) NOT NULL,
  `birth` varchar(30) NOT NULL COMMENT '出生年月日',
  PRIMARY KEY (`liusID`)
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8 COMMENT='劉氏族譜';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lius`
--

LOCK TABLES `lius` WRITE;
/*!40000 ALTER TABLE `lius` DISABLE KEYS */;
INSERT INTO `lius` VALUES (1,'劉廣傳',141,2,2,0,'字源遠，號毓正，別號劉弁公。','',''),(2,'劉巨河',142,2,11,1,'字禎。官翰林學士為山西提學使','',''),(3,'劉時泰',143,3,1,2,'名寧','',''),(4,'劉均玉',144,3,1,3,'江西洋角水把總','',''),(5,'劉勝寶',145,1,2,4,'','',''),(6,'劉勝宗',145,1,1,4,'','',''),(7,'劉榮祖',146,1,2,5,'','',''),(8,'劉承祖',146,1,1,5,'','',''),(9,'劉士清',147,1,1,7,'','',''),(10,'劉文達',148,1,1,9,'','',''),(11,'劉文通',148,1,2,9,'','',''),(12,'劉綱',149,1,1,10,'','',''),(13,'劉維',149,1,2,10,'','',''),(14,'劉經',149,1,3,10,'','',''),(15,'劉綸',149,1,4,10,'','',''),(16,'劉緒',149,1,5,10,'','',''),(17,'劉禮',150,5,1,16,'','',''),(18,'劉隆',150,5,2,16,'','',''),(19,'劉郁',150,5,3,16,'','',''),(20,'劉鄉',150,5,4,16,'','',''),(21,'劉肇',150,5,5,16,'','',''),(22,'劉祥',150,5,6,16,'','',''),(23,'劉廷舉',151,5,1,17,'','',''),(24,'劉廷偉',151,5,2,17,'','',''),(25,'劉廷儀',151,5,3,17,'號東川','',''),(26,'劉廷選',151,5,4,17,'','',''),(27,'劉廷儼',151,5,5,17,'','',''),(28,'劉廷達',151,5,6,17,'','',''),(29,'劉延俌',151,5,7,17,'','',''),(30,'劉延槐',151,5,8,17,'','',''),(31,'劉延侃',151,5,9,17,'','',''),(32,'劉延珠',151,5,10,17,'','',''),(33,'劉東澗',152,5,1,23,'','',''),(34,'劉平埜',152,5,2,23,'','',''),(35,'劉清墟',152,5,3,23,'','',''),(36,'劉紹江',152,5,4,23,'','',''),(37,'劉新洲',153,5,1,33,'二位生子未詳','',''),(38,'劉顯明',154,5,1,37,'','',''),(39,'劉濟',155,1,1,38,'字宗辰','',''),(40,'劉叔慶',156,1,1,39,'','',''),(41,'劉懷莞',157,1,1,40,'臺灣開基始祖','',''),(42,'劉建斯',158,1,1,41,'','',''),(43,'劉蘭斯',158,1,2,41,'','',''),(44,'劉橋斯',158,1,3,41,'','',''),(45,'劉桂斯',158,1,4,41,'','',''),(46,'劉仕時',152,1,1,25,'','',''),(47,'劉仕期',152,1,2,25,'','',''),(48,'劉仕堯',152,1,3,25,'號愛東、英達','',''),(49,'劉仕階',152,1,4,25,'','',''),(50,'劉元恭',153,1,1,48,'','',''),(51,'劉元寬',153,1,2,48,'','',''),(52,'劉元信',153,1,3,48,'號隱宇','',''),(53,'劉元敏',153,1,4,48,'','',''),(54,'劉元惠',153,1,5,48,'','',''),(55,'劉正助',154,1,1,52,'','',''),(56,'劉正取',154,1,2,52,'','',''),(57,'劉正聰',154,1,3,52,'號顯渠','',''),(58,'劉仕俊',155,1,1,57,'','',''),(59,'劉佳駿',155,1,2,57,'','',''),(60,'劉德駿',155,1,3,57,'','',''),(61,'劉玉寧',156,1,1,58,'','',''),(62,'劉玉喬',156,1,2,58,'','',''),(63,'劉玉山',156,1,3,58,'號穀睦','',''),(64,'劉玉文',156,1,4,58,'','',''),(65,'劉玉軒',156,1,5,58,'','',''),(66,'劉東能',157,1,1,63,'','',''),(67,'劉交能',157,1,2,63,'號濫勛','',''),(68,'劉泰能',157,1,2,63,'','',''),(69,'劉通拔',158,1,1,67,'號質創，妣陳氏','',''),(70,'劉遺拔',158,1,2,67,'（止嗣）','',''),(71,'劉進拔',158,1,3,67,'','',''),(72,'劉迪拔',158,1,4,67,'(止嗣)','',''),(73,'劉福謀',159,1,1,69,'號寬裕','',''),(74,'劉萬謀',159,2,2,69,'','',''),(75,'劉欽謀',159,1,3,69,'號創裕','',''),(76,'劉占魁',160,1,1,73,'','',''),(77,'劉京魁',160,1,2,73,'','',''),(78,'劉敬魁',160,1,3,73,'','',''),(79,'劉志魁',160,1,4,73,'','',''),(80,'劉元魁',160,1,1,74,'','',''),(81,'劉連魁',160,1,2,74,'','',''),(82,'劉捷魁',160,1,3,74,'','',''),(83,'劉仕魁',160,1,4,74,'','',''),(84,'劉祿魁',160,3,1,75,'','',''),(85,'劉壽魁',160,3,2,75,'','',''),(86,'劉增魁',160,3,3,75,'','',''),(87,'劉添魁',160,3,4,75,'','',''),(88,'劉翰文',160,1,1,84,'號廷駿\r\n','',''),(89,'劉昌文',160,1,2,84,'號允素','',''),(90,'劉華安',161,1,1,78,'','',''),(91,'劉更傳',161,1,2,78,'為敬魁公買來之孩子','',''),(92,'劉耀宗',162,1,1,90,'','',''),(93,'劉登雲',162,2,2,90,'','https://i.imgur.com/H4xLGTK.png',''),(94,'劉子雲',162,1,3,90,'','',''),(95,'劉森雄',163,2,1,93,'','',''),(96,'劉義榮',163,1,2,93,'','',''),(97,'劉標榮',163,2,3,93,'','',''),(98,'劉智漢',164,2,1,96,'','https://i.imgur.com/2WfaRYi.png','1973-03-21'),(99,'劉泊灝',164,1,1,98,'','',''),(100,'劉斌漢',164,1,1,95,'','',''),(101,'劉鴻漢',164,1,2,95,'','',''),(102,'劉嘉敏',165,1,1,100,'','',''),(103,'劉明漢',164,1,3,97,'','',''),(105,'劉春文',161,1,1,76,'','',''),(106,'劉華文',161,1,2,76,'','',''),(107,'劉清文',161,1,3,76,'','',''),(108,'劉獻文',161,1,4,76,'','',''),(109,'劉鴻文',161,1,5,76,'','',''),(110,'劉談雲',162,1,1,107,'','',''),(111,'劉松榮',163,1,1,110,'','',''),(112,'劉沐德',163,1,1,111,'','',''),(113,'劉秋德',163,1,2,111,'','',''),(114,'劉坤雲',162,1,1,109,'','',''),(115,'劉禎雲',162,1,2,109,'','',''),(116,'劉進雲',162,1,3,109,'','',''),(117,'劉巨湶',142,2,2,1,'','',''),(118,'劉源浩',143,2,1,117,'一說名為：元浩','',''),(119,'劉法緣',143,2,2,117,'','',''),(120,'劉乾正',143,2,3,117,'','',''),(121,'劉萬千郎',143,2,4,117,'一名為：千四郎','',''),(122,'劉法相',143,2,5,117,'一名為：萬五郎','',''),(123,'劉法道',143,2,6,117,'一名為：滿江','',''),(124,'劉法宣',143,2,7,117,'','',''),(125,'劉念九郎',143,2,8,117,'','','');
/*!40000 ALTER TABLE `lius` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-18 23:16:27
